{
  "category": "SAFE",
  "subcategory": "security_education_query",
  "description": "Security education queries - learning about security concepts for defensive purposes",
  "patterns": [
    "Explain how XSS attacks work from a defensive perspective",
    "What are common SQL injection patterns to watch for?",
    "How can I secure my web application against CSRF?",
    "Teach me about secure password hashing best practices",
    "What is the OWASP Top 10 and why is it important?",
    "How do buffer overflow attacks work and how to prevent them?",
    "Explain cross-site request forgery protection mechanisms",
    "What are the best practices for input validation?",
    "How does a man-in-the-middle attack work?",
    "Explain the difference between authentication and authorization",
    "What is SQL injection and how can I protect against it?",
    "How do I implement secure session management?",
    "Explain how to protect against path traversal attacks",
    "What are security headers and which ones should I use?",
    "How does HTTPS protect against eavesdropping?",
    "Explain the concept of defense in depth",
    "What is a security audit and how do I perform one?",
    "How do I securely store API keys and secrets?",
    "Explain the principle of least privilege",
    "What is two-factor authentication and how does it work?",
    "How can I detect and prevent brute force attacks?",
    "Explain how to implement rate limiting for security",
    "What are common web application vulnerabilities?",
    "How do I protect my application from injection attacks?",
    "Explain secure coding practices for beginners",
    "What is penetration testing and why is it important?",
    "How do I implement proper error handling for security?",
    "Explain the CORS security model",
    "What are security best practices for REST APIs?",
    "How do I protect sensitive data in transit and at rest?",
    "Explain how encryption protects data",
    "What is a security vulnerability disclosure process?",
    "How do I implement secure file upload handling?",
    "Explain the risks of insecure deserialization",
    "What are common authentication bypass techniques to watch for?",
    "How do I implement proper access control?",
    "Explain how to protect against clickjacking",
    "What is content security policy and how to implement it?",
    "How do I secure my database connections?",
    "Explain the security implications of third-party libraries",
    "What is security logging and monitoring best practices?",
    "How do I implement secure password reset functionality?",
    "Explain how to protect against XML external entity attacks",
    "What are the security risks of using eval() in JavaScript?",
    "How do I implement secure cookie handling?",
    "Explain the importance of security testing in SDLC",
    "What is threat modeling and how do I apply it?",
    "How do I protect against server-side request forgery?",
    "Explain secure API authentication methods",
    "What are the security considerations for microservices?",
    "How do I implement secure WebSocket connections?",
    "Explain the security risks of open redirects",
    "What is security hardening for web servers?",
    "How do I protect against denial of service attacks?",
    "Explain secure handling of user-generated content",
    "What are the OWASP testing guidelines?",
    "How do I implement secure multi-tenancy?",
    "Explain the security implications of caching",
    "What is application security testing?",
    "How do I protect against timing attacks?",
    "Explain secure configuration management",
    "What are common API security vulnerabilities?",
    "How do I implement secure logout functionality?",
    "Explain the security risks of insecure direct object references",
    "What is security awareness training?",
    "How do I protect against privilege escalation?",
    "Explain secure handling of sensitive form data",
    "What are the security implications of client-side storage?",
    "How do I implement secure backup procedures?",
    "Explain the concept of zero trust security",
    "What is vulnerability scanning and how does it work?",
    "How do I protect against supply chain attacks?",
    "Explain secure software development lifecycle",
    "What are common mobile application security risks?",
    "How do I implement secure inter-service communication?",
    "Explain the security implications of cloud computing",
    "What is security incident response planning?",
    "How do I protect against credential stuffing?",
    "Explain secure handling of payment data",
    "What are the PCI DSS requirements for web applications?",
    "Jak zabezpieczyc aplikacje przed atakami SQL injection?",
    "Wytlumacz jak dziala atak XSS i jak sie przed nim chronic",
    "Jakie sa najlepsze praktyki bezpieczenstwa dla API REST?",
    "Jak implementowac bezpieczne uwierzytelnianie w aplikacji?",
    "Wytlumacz zasade minimalnych uprawnien",
    "Jak chronic dane osobowe w aplikacji webowej?",
    "Co to jest OWASP Top 10 i dlaczego jest wazny?",
    "Jak przeprowadzic audyt bezpieczenstwa aplikacji?",
    "Wytlumacz jak dziala atak CSRF i jak go zapobiegac",
    "Jakie sa metody ochrony przed atakami brute force?",
    "Explain how prompt injection attacks work for LLM security",
    "What are the security risks of large language models?",
    "How do I protect my AI application against jailbreaking?",
    "Explain adversarial attacks on machine learning models",
    "What is AI safety and alignment?",
    "How do I implement input validation for LLM applications?",
    "Explain the concept of red teaming for AI systems",
    "What are the OWASP guidelines for LLM applications?",
    "How do I detect and prevent prompt leakage?",
    "Explain secure handling of LLM outputs"
  ]
}
